{"chunks": ["Rushikesh Margode Email | rushikeshmargode@smartdatainc.net Skills ● Generative AI: Custom ChatBot | ChatGPT -4 | LLM(Large Language Model) | LLM Apps | LlamaIndexLangchain -RAG | OpenAI. | OpenAI Embedding | Prompt Engineering | Real -Time Voice | TTS | STT ● Machine Learning techniques (supervised & unsupervised) : Regression | Classifica tion | KNN | K -means Clustering ● Python Frameworks : Flask | Django ● NLP: NLTK | Bag of Words | word2vec | doc2vec | keyphrase extraction | Understanding | representation | classification & clustering of Text. ● Database : Pinecone Vector DB | Postgresql | SQL | CRUD operations | ● Cloud Platforms : EC2 | Sagemaker | Notebook instance | AWS TEXTRACT | ● System Automation & Improvement: CI/CD pipeline by using Docker and Jenkins. ● Deep Learning : Neu", "ce | AWS TEXTRACT | ● System Automation & Improvement: CI/CD pipeline by using Docker and Jenkins. ● Deep Learning : Neural Networks | ANN | CNN | RNN | Tensorflow | Keras. ● Computer Vision : OpenCV | Image Processing | Object Detection | Face Detection | Image Segmentation | Real -time Processing. ● Project Management Tools : JIRA | Asana Technical Skills ● Vector database management like Pinecone by using RAG concept combinat ion with vector embeddings. ● Real -Time voice assistance by using OpenAI TTS and STT models. ● Experienced in leveraging and fine -tuning various Large Language Models (LLMs) like GPT, BERT, and LLaMA for diverse NLP applications. ● A professional with experience in Python, and Machine Learning, with expertise in Healthcare, Real Estate, document classificationa a", "l with experience in Python, and Machine Learning, with expertise in Healthcare, Real Estate, document classificationa and text extraction domain projects. ● Implemented Object Detection algorithms, including YOLO and Faster RCNN, showcasing expertise in accurate object detection ● Ability to write clean and production code with OOPs in Python. ● Expertise in OCR based applications. Education ● MCA | 2021 | Shri Ramdeobaba college of Engineering and Management, Nagpur | 8.21 CGPA ● BCA | 2019 | RTMNU , Nagpur| 69.19% Work Experience\n\n ● 3+ Years of Working Experience at SmartData Enterprises , Nagpur as AI/ML Engineer(Associate Level 3) from Dec 2021 – Present Projects Project Name: Genesis AI Domain: Healthcare Description: Developed a healthcare application to transcribe doctor -patient", "oject Name: Genesis AI Domain: Healthcare Description: Developed a healthcare application to transcribe doctor -patient conversations and generate SOAP notes. Implemented features for sentiment analysis, medical code identification, and a chatbot for medical form filling using the RAG approach. Built a medication recommend ation system based on patient history leveraging Pinecone DB. Responsibilities : ● Integrated AI in a healthcare application to process recorded doctor -patient conversations. ● Implemented speech -to-text conversion using OpenAI's Whisper -large -v3 model for transcription. ● Leveraged OpenAI's Llama -3.3-70b-versatile model to generate SOAP notes from the transcribed text. ● Integrated sentiment analysis and medical code identification for enhanced diagnostic insights.", "the transcribed text. ● Integrated sentiment analysis and medical code identification for enhanced diagnostic insights. ● Designed a chatbot for medical form fil ling using the Retrieval -Augmented Generation (RAG) approach. ● Built a medication recommendation system utilizing Pinecone DB and RAG based on patients' historical data. Project Name: HOA (Home Owners Association) AI Platform Domain: Real Estate Descript ion: Developed a subscription -based real estate platform for Housing Owners Associations. Features include community search, access to overview, rules, documents, and vendor details (local, health, education). Implemented four user roles (super admin, admi n, homeowners, realtors). Leveraged GPT -4 for generating vendor data, community overviews, andrules via Flask APIs integr", "homeowners, realtors). Leveraged GPT -4 for generating vendor data, community overviews, andrules via Flask APIs integrated with the Django application. Designed for secure, scalable access based on subscription tiers. Responsibilities : ● Developed a su bscription -based real estate platform for Housing Owners Associations with tiered access. ● Designed features for community search, overview access, rules, document management, and vendor details (local, health, and education). ● Implemented role -based access control with four user roles: super admin, admin, homeowners, and realtors. ● Leveraged GPT -4 APIs to generate vendor data, community overviews, and rules, integrating Flask APIs with a Django application. ● Architected the platform for secure and s calable access based on subscri", "rating Flask APIs with a Django application. ● Architected the platform for secure and s calable access based on subscription tiers. ● Developed a chatbot for user engagement and support using Pinecone Vector DB and the Retrieval -Augmented Generation (RAG) approach."], "sources": [{"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 8, "filename": "RushikeshSDResumeUpdated.pdf"}]}