{"chunks": ["Akash Bhoyar [akashbhoyar@smartdatainc.net ] smartData Enterprises (India) Ltd Summary Full Stack Developer with over 5 years of experience specializing in the MERN stack (MongoDB, Express.js, React.js, Node.js). Highly proficient in building scalable, high -performance web applications using React.js, Node.js, Angular, MySQL and MongoDB. Skilled in designing and developing high -level architecture and delivering scalable solutions across various projects. Professional Expertise • Languages : JavaScript, Node.js, Express, React JS , Angular, Restful API’s • Databases : Mongo DB, MySQL • Operating Systems: Ubuntu, Window • Source Version Controls : GitHub and GitLab • Task Management Tool : Jira, Basecamp • Good Experience in using HTML, CSS3, JavaScript,TypeScript. Education Bachelor of En", "Management Tool : Jira, Basecamp • Good Experience in using HTML, CSS3, JavaScript,TypeScript. Education Bachelor of Engineering from Amravati university in 2019. Strengths • Ability to learn new technology quickly. • Discipline & Decision Making. • Ability to Work Under Pressure. • Self-motivation. • Results -oriented • Business development • Organizational capacity • Ability to motivate staff and maintain good relations \n\n Page 2 Experience Current Employer —smartData Enterprises (I) Ltd. Sept 2023 – Present Role – Sr. Associate Level - I • Working as a Full Stack Developer with core expertise in MERN and MEAN stacks. • Contributed to multiple end -to-end web applications across domains like health insurance, on-demand services, and operational platforms. • Collaborated with cross -func", "ons across domains like health insurance, on-demand services, and operational platforms. • Collaborated with cross -functional teams including QA, DevOps, and UI/UX to ensure timely delivery. Professional Experience Project: Health Care Share Ministry Insurance Portal Description : • Full -Stack Developer • Technology Stack : React.js, Node.js, PostgreSQL, NMI Payment Gateway. • Developed a comprehensive web -based platform for NetWell, a Health Care Sharing Ministry (HCSM), enabling members with shared religious or ethical beliefs to contribute to a shared fund used for eligible medical expenses. • The platform offers customizable plans for catastrophic, preventive, and all -inclusive care including telemedicine, ER visits, and hospitalization —as a cost -effective alternative to traditio", "all -inclusive care including telemedicine, ER visits, and hospitalization —as a cost -effective alternative to traditional health insurance. • Key Modules & Responsibilities: Designed and implemented user and agent workflows , including quote generation, and claim submissions. Developed a unified portal supporting both Members and Agents to streamline interactions and policy management. Integrated NMI Payment Gateway for secure and recurring program subscriptions. Implemented SMTP -based email notifications for account updates, policy confirmations, and claim statuses. \n\n Page 3 Project: Geome Service Platform Description: • MERN Stack Developer • Technology Stack : MERN (MongoDB, Express.js, React.Js, Node.js) • Developed a comprehensive multi -role on -demand service booking platform th", "(MongoDB, Express.js, React.Js, Node.js) • Developed a comprehensive multi -role on -demand service booking platform that connects customers with verified service providers across various categories such as wellness, education, fitness, and healthcare. The system includes dedicated mobile applications for customers and service providers, and a web -based Super Admin portal to manage platform operations. • Key Modules & Responsibilities : • Implemented secure signup/login (email/password, OTP -based reset), session handling, and role -based access control for customers, providers, and admins. • Manage users, providers, services, categories, articles, reviews. • Manual document verification system. • Built -in text editor integration for content management. • Push and email notifications fo", "ument verification system. • Built -in text editor integration for content management. • Push and email notifications for booking confirmations, profile verification, reminders, and status updates. • Full feedback system with review management and moderation. CMS for article posting with rich media support. • Statistics for users, providers, earnings, and appointments for operational visibility. \n\n Page 4 Project: smaStep Application Description: • MEAN Stack Developer • Technology Stack : MERN (MongoDB, Express.js, Angular, Node.js). • SmaStep is an end -to-end cleaning service management platform designed to help a cleaning company efficiently manage customers, employees, job scheduling, work reporting, and site -level execution. The system includes web portals for managers and admins, a", "s, job scheduling, work reporting, and site -level execution. The system includes web portals for managers and admins, and a mobile app for field workers (cleaning staff) to interact with job assignments and submit reports. • Key Modules & Responsibilities : • Developed modules for creation and management of different user roles: Admin, Manager, Worker, and Customer. • Customers can be added directly by Admins or Managers. • Multiple facilities (locations) can be linked to a single customer specifying cleaning days, frequency, and preferences • Managers can create jobs: • One -time • Recurring (Daily, Weekly, Monthly) • Jobs are assigned to specific workers. Recurring jobs auto -generate based on rules. • Reports submitted by workers become visible on the Manager Dashboard . • Managers can", "s auto -generate based on rules. • Reports submitted by workers become visible on the Manager Dashboard . • Managers can review reports, add remarks, and \"Mark as Completed\" to move them to the archive.", "Rushikesh Margode Email | rushikeshmargode@smartdatainc.net Skills ● Generative AI: Custom ChatBot | ChatGPT -4 | LLM(Large Language Model) | LLM Apps | LlamaIndexLangchain -RAG | OpenAI. | OpenAI Embedding | Prompt Engineering | Real -Time Voice | TTS | STT ● Machine Learning techniques (supervised & unsupervised) : Regression | Classifica tion | KNN | K -means Clustering ● Python Frameworks : Flask | Django ● NLP: NLTK | Bag of Words | word2vec | doc2vec | keyphrase extraction | Understanding | representation | classification & clustering of Text. ● Database : Pinecone Vector DB | Postgresql | SQL | CRUD operations | ● Cloud Platforms : EC2 | Sagemaker | Notebook instance | AWS TEXTRACT | ● System Automation & Improvement: CI/CD pipeline by using Docker and Jenkins. ● Deep Learning : Neu", "ce | AWS TEXTRACT | ● System Automation & Improvement: CI/CD pipeline by using Docker and Jenkins. ● Deep Learning : Neural Networks | ANN | CNN | RNN | Tensorflow | Keras. ● Computer Vision : OpenCV | Image Processing | Object Detection | Face Detection | Image Segmentation | Real -time Processing. ● Project Management Tools : JIRA | Asana Technical Skills ● Vector database management like Pinecone by using RAG concept combinat ion with vector embeddings. ● Real -Time voice assistance by using OpenAI TTS and STT models. ● Experienced in leveraging and fine -tuning various Large Language Models (LLMs) like GPT, BERT, and LLaMA for diverse NLP applications. ● A professional with experience in Python, and Machine Learning, with expertise in Healthcare, Real Estate, document classificationa a", "l with experience in Python, and Machine Learning, with expertise in Healthcare, Real Estate, document classificationa and text extraction domain projects. ● Implemented Object Detection algorithms, including YOLO and Faster RCNN, showcasing expertise in accurate object detection ● Ability to write clean and production code with OOPs in Python. ● Expertise in OCR based applications. Education ● MCA | 2021 | Shri Ramdeobaba college of Engineering and Management, Nagpur | 8.21 CGPA ● BCA | 2019 | RTMNU , Nagpur| 69.19% Work Experience\n\n ● 3+ Years of Working Experience at SmartData Enterprises , Nagpur as AI/ML Engineer(Associate Level 3) from Dec 2021 – Present Projects Project Name: Genesis AI Domain: Healthcare Description: Developed a healthcare application to transcribe doctor -patient", "oject Name: Genesis AI Domain: Healthcare Description: Developed a healthcare application to transcribe doctor -patient conversations and generate SOAP notes. Implemented features for sentiment analysis, medical code identification, and a chatbot for medical form filling using the RAG approach. Built a medication recommend ation system based on patient history leveraging Pinecone DB. Responsibilities : ● Integrated AI in a healthcare application to process recorded doctor -patient conversations. ● Implemented speech -to-text conversion using OpenAI's Whisper -large -v3 model for transcription. ● Leveraged OpenAI's Llama -3.3-70b-versatile model to generate SOAP notes from the transcribed text. ● Integrated sentiment analysis and medical code identification for enhanced diagnostic insights.", "the transcribed text. ● Integrated sentiment analysis and medical code identification for enhanced diagnostic insights. ● Designed a chatbot for medical form fil ling using the Retrieval -Augmented Generation (RAG) approach. ● Built a medication recommendation system utilizing Pinecone DB and RAG based on patients' historical data. Project Name: HOA (Home Owners Association) AI Platform Domain: Real Estate Descript ion: Developed a subscription -based real estate platform for Housing Owners Associations. Features include community search, access to overview, rules, documents, and vendor details (local, health, education). Implemented four user roles (super admin, admi n, homeowners, realtors). Leveraged GPT -4 for generating vendor data, community overviews, andrules via Flask APIs integr", "homeowners, realtors). Leveraged GPT -4 for generating vendor data, community overviews, andrules via Flask APIs integrated with the Django application. Designed for secure, scalable access based on subscription tiers. Responsibilities : ● Developed a su bscription -based real estate platform for Housing Owners Associations with tiered access. ● Designed features for community search, overview access, rules, document management, and vendor details (local, health, and education). ● Implemented role -based access control with four user roles: super admin, admin, homeowners, and realtors. ● Leveraged GPT -4 APIs to generate vendor data, community overviews, and rules, integrating Flask APIs with a Django application. ● Architected the platform for secure and s calable access based on subscri", "rating Flask APIs with a Django application. ● Architected the platform for secure and s calable access based on subscription tiers. ● Developed a chatbot for user engagement and support using Pinecone Vector DB and the Retrieval -Augmented Generation (RAG) approach."], "sources": [{"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 15, "filename": "Akash-Bhoyar_NodeJS_2.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}, {"document_id": 16, "filename": "RushikeshSDResumeUpdated.pdf"}]}