{"chunks": ["YOGESH PACHDHARE Email: yogeshpachdhare1999@gmail.com Phone: +91 -9325544626 GitHub: github.com/YogPach LinkedIn: www.linkedin.com/in/yogesh -pachdhare PROFESSIONAL SUMMARY Sr Software Developer with 3+ years of hands -on experience in backend and full -stack development using .NET technologies, Angular, SQL Server, and Azure. Adept at building scalable Web APIs, integrating third -party services, and deploying applications via Azure DevOps. Strong problem -solving skills, experienced in Agile methodologies using Jira, and highly collaborative in cross -functional environments. TECHNICAL SKILLS Backend : C#, .NET Core, ASP.NET MVC, Web API, Entity Framework, LINQ Frontend : Angular, HTML, CSS, JavaScript, Kendo UI Database : SQL Server, PostgreSQL, Stored Procedures Cloud/DevOps : Azure, A", ": Angular, HTML, CSS, JavaScript, Kendo UI Database : SQL Server, PostgreSQL, Stored Procedures Cloud/DevOps : Azure, Azure DevOps, CI/CD, IIS, Console Applications Tools & Others : Git, Jira, Power BI, JSON, XML, RESTful APIs, Webhooks PROFESSIONAL EXPERIENCE Sr. Software Developer Baruni Solutions Pvt. Ltd., 09/2024 – Present Nagpur Achievements/Tasks  Worked on 4 major projects including healthcare and jewelry commerce platforms.  Designed and deployed RESTful Web APIs using .NET Core and both SQL Server & PostgreSQL.  Created and optimized stored procedures to enhance database performance.  Integrated third -party email/webhook services for external communication.  Built and maintained CI/CD pipelines using Azure DevOps.  Used Jira for task tracking and cross -team collaboration", ".  Built and maintained CI/CD pipelines using Azure DevOps.  Used Jira for task tracking and cross -team collaboration.  Developed new modules from scratch with updated .NET Web API and SQL Server.  Handled module -specific requirements and front end and backend features.  Developed console apps and web services to sync jewelry product data via CSV, triggered every 10 –15 minutes. Software Developer Senwell Groups 04/2024 - 09/2024 Pune Achievements/Tasks  Developed and maintained an ASP.NET MVC application integrated with Kendo UI, enhancing frontend interactivity and user experience.  Implemented robust SQL Server solutions for efficient data management, including schema design, optimization, and writing complex queries.  Created insightful Power BI reports that provided actionab", "g schema design, optimization, and writing complex queries.  Created insightful Power BI reports that provided actionable business insights, supporting informed decision - making.  Deployed and managed applicati ons on Azure servers, ensuring scalability, reliability, and optimal performance.  Utilized Jira for task management, ensuring timely completion of deliverables and transparent project tracking.  Acted as a primary liaison for foreign clients, providing regu lar status updates, gathering requirements, and ensuring client satisfaction through effective communication. \n\nAssociate Software Developer L -II Tudip Technologies 05/2022 – 03/2024 Pune Achievements/Tasks  Successfully developed and implemen ted a robust Web API using .NET Framework, enhancing data accessibility and int", "ks  Successfully developed and implemen ted a robust Web API using .NET Framework, enhancing data accessibility and integration capabilities.  Deployed the application on Azure servers for ensuring scalability, reliability, and efficient performance.  Managed sensitive customer, client, and employ ee data securely in SQL Server, adhering to data protection regulations.  Developed and maintained the Web API, facilitating seamless communication between frontend and backend systems.  Utilized Entity Framework for database management, including writing LI NQ queries and running migration scripts to update database schema.  Implemented exception handling strategies to improve application stability and user experience.  Designed and created models to map user input to database tables, ens", "prove application stability and user experience.  Designed and created models to map user input to database tables, ensuring accurate data sto rage and retrieval.  Deployed and maintained applications on Azure servers, with occasional use of IIS for related projects, ensuring optimal performance and availability. PERSONAL PROJECTS  Blogify : ASP.NET MVC -based blogging platform with CMS -style user management, posting, and content organization.  Medicine Management System (VB.NET): Ayurvedic medicine inventory and sales tracking for shopkeepers and customers.  Hospital Management System (VB.NET ): End -to-end hospital registration, pharmacy, and bil ling system.  Garment Shop Management System (VB.NET) : Tracks inventory, payments, payroll, and includes invoice printing. EDUCATION Ma", "rment Shop Management System (VB.NET) : Tracks inventory, payments, payroll, and includes invoice printing. EDUCATION Master of Computer Applications (MCA) Shri Ramdeobaba College of Engineering & Management, Nagpur 2020 – 2022 Bachelor of Commerce in Computer Applications (BCCA ) G.S. College of Commerce & Economics, Nagpur 2016 – 2019 LANGUAGES English, Hindi, Marathi INTERESTS Exploring Technology, Music, Cricket"], "sources": [{"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}, {"document_id": 20, "filename": "YogeshPachdhareResume2025.pdf"}]}